var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "刘镇鸣",
    sex: "男",
    age: "14",
    phone: "17734258540",
    email: "2124619132@qq.com",
    address: "现居河北省保定市涿州市码头镇北芦小区",
    qq: "2124619132",
    log: "LiuZhenming",
    excpect_work: "后端开发者",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好，我是刘镇鸣，涿州市码头学校在读生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫刘镇鸣，性别男，码头学校在读。我期望的工作岗位是后端开发。</p>" +
        "<p>我有着较多的Python编程经验，计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当，能够接受组织的一切安排。</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["Python", 80, "red"],
        ["HTML", 77, "blue"],
        ["CSS", 75, "#1abc9c"],
        ["JavaScript", 67, "rgba(0,0,0)"],
        ["C#", 60, "yellow"],
        ["Vue", 70, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>操作系统、计算机网络等编程基础知识良好。</li>" +
        "     <li>熟练掌握Python基础。</li>" +
        "     <li>熟悉Python多线程、集合等基础框架。</li>" +
        "     <li>了解Vue框架。</li>" +
        "     <li>熟悉C#语言开发基本知识。</li>" +
        "     <li>熟悉SQL语句编写以及调优。</li>" +
        "     <li>熟悉基本Linux命令操作。</li>" +
        "     <li>熟悉Spring、ibatis、struts等框架的使用，了解其原理与机制。</li>" +
        "     <li>熟悉缓存、消息等机制。</li>" +
        "     <li>了解分布式系统的设计与应用。</li>" +
        "     <li>熟悉HTML、CSS、JavaScript以及相应前端知识。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["https://img-blog.csdnimg.cn/46c4b107e5c3450a9df111a3e1f78464.png", "https://blog.csdn.net/weixin_41102528?type=lately", "我的CSDN博客", "这里记录了我所有的学习笔记<br>持续更新"],
        ["https://img-blog.csdnimg.cn/2cea057b95ba4100a485f23dc282d486.png", "https://github.com/ProgramApeInn/PySimpleGUI-Root-App", "PySimpleGUI桌面翻译器", "采用Python编写的翻译神器<br>2021/7/23"],
        ["https://img-blog.csdnimg.cn/ad0fbddd5728402790a67e33b59dc7c9.png", "https://github.com/ProgramApeInn/The-windows-pickle-login-tkinter-python-project", "用户登录系统", "Python+pickle+tkinter"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2022/10/10 — 2022/11/4", "<br>CBC技术社区",
            "<p><strong>和CSDN技术博主Yu·仙笙的合作</strong></p>" +
            "<p>2022年十月中旬，技术博主Yu·仙笙邀我与其共建他新创立的技术社区——CBC技术社区，截至十一月初，社区共有300名成员、358张帖子。</p>"
        ],

        ["2022/10/29 — 2025/10/29", "<br>游戏项目:地下十三层",
            "<p><strong>八月使者社区(地下十三层项目小组)</strong></p>" +
            "<p>十月底，我与B站设计领域UP主石煜祺线下会面后决定发起游戏项目《地下十三层》，目前正在策划阶段中。</p>"
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2017-11-18", "CSDN开发者社区", "我受师傅刘术伟先生邀请，正式入驻CSDN"],
        ["2020-2-20", "CSDN开发者社区", "我在CSDN开发者社区首发原创文章"],
        ["2022-10-20", "八月使者技术社区", "八月使者技术社区(地下十三层项目小组)正式成立"],
        ["预计于2023年3月参加CSP认证考试", "中国计算机学会(CCF)", "我的flag：在CSP-J组中通过笔试并在机试中取得超过300分的成绩"],
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/博客.svg", "https://space.bilibili.com/1715213283?spm_id_from=333.1007.0.0", "我的bilbil主页"],
        ["./svg/github.svg", "https://github.com/ProgramApeInn", "我的GitHub主页"],
        ["./svg/csdn.svg", "http://1.15.234.109:8000", "我的csdn主页"],
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/5.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}
